Repository: tuildes/hash-key
Catalog: Localizable.xcstrings
Source language: en
Languages: de, es, fr, id, ja, pt_br, pt_pt

source: %lld bits
de: %lld Bit
id: %lld bit
ja: %lld ビット

# %lld bruteforce_days
source: %lld days
de: %lld Tage
es: %lld días
fr: %lld jours
id: %lld hari
ja: %lld 日
pt_br: %lld dias
pt_pt: %lld dias

# %lld bruteforce_decades
source: %lld decades
de: %lld Jahrzehnte
es: %lld décadas
fr: %lld décennies
id: %lld dekade
ja: %lld 十年
pt_br: %lld décadas
pt_pt: %lld décadas

# %lld bruteforce_hours
source: %lld hours
de: %lld Stunden
es: %lld horas
fr: %lld heures
id: %lld jam
ja: %lld 時間
pt_br: %lld horas
pt_pt: %lld horas

# %lld bruteforce_years
source: %lld years
de: %lld Jahre
es: %lld años
fr: %lld ans
id: %lld tahun
ja: %lld 年
pt_br: %lld anos
pt_pt: %lld anos

# bruteforce_centuries
source: Centuries
de: Jahrhunderte
es: Siglos
fr: Siècles
id: Abad
ja: 世紀
pt_br: Séculos
pt_pt: Séculos

# bruteforce.entropy
source: Entropy
de: Entropie
es: Entropía
fr: Entropie
id: Entropi
ja: エントロピー
pt_br: Entropia
pt_pt: Entropia

# bruteforce.instant
source: Instant
de: Sofort
es: Instantáneo
fr: Instantané
id: Instan
ja: 即時
pt_br: Instantâneo
pt_pt: Instantâneo

# charset.lowercase
source: Lowercase
de: Kleinbuchstaben
es: Minúsculas
fr: Minuscules
id: Huruf kecil
ja: 小文字
pt_br: Minúsculas
pt_pt: Minúsculas

# charset.numbers
source: Numbers
de: Zahlen
es: Números
fr: Chiffres
id: Angka
ja: 数字
pt_br: Números
pt_pt: Números

# charset.symbols
source: Symbols
de: Symbole
es: Símbolos
fr: Symboles
id: Simbol
ja: 記号
pt_br: Símbolos
pt_pt: Símbolos

# charset.uppercase
source: Uppercase
de: Großbuchstaben
es: Mayúsculas
fr: Majuscules
id: Huruf besar
ja: 大文字
pt_br: Maiúsculas
pt_pt: Maiúsculas

source: Copied!
de: Kopiert!
es: ¡Copiado!
fr: Copié !
id: Disalin!
ja: コピーしました！
pt_br: Copiado!
pt_pt: Copiado!

source: Get Started
de: Loslegen
es: Comenzar
fr: Commencer
id: Mulai
ja: 始める
pt_br: Começar
pt_pt: Começar

# hashes.title
source: Cryptographic hashes
de: Kryptografische Hashes
es: Hashes criptográficos
fr: Hachages cryptographiques
id: Hash kriptografi
ja: 暗号ハッシュ
pt_br: Hashes criptográficos
pt_pt: Hashes criptográficos

source: Length
de: Länge
es: Longitud
fr: Longueur
id: Panjang
ja: 長さ
pt_br: Comprimento
pt_pt: Comprimento

source: MIT License
de: MIT-Lizenz
es: Licencia MIT
fr: Licence MIT
id: Lisensi MIT
ja: MITライセンス
pt_br: Licença MIT
pt_pt: Licença MIT

# no.charset
source: No charset selected
de: Kein Zeichensatz ausgewählt
es: Ningún conjunto seleccionado
fr: Aucun jeu de caractères sélectionné
id: Tidak ada set karakter yang dipilih
ja: 文字セットが選択されていません
pt_br: Nenhum conjunto selecionado
pt_pt: Nenhum conjunto selecionado

# onboarding.description1
source: Create strong, random passwords instantly using secure generation methods.
de: Erstellen Sie sofort starke, zufällige Passwörter mit sicheren Generierungsmethoden.
es: Crea contraseñas fuertes y aleatorias al instante usando métodos de generación seguros.
fr: Créez instantanément des mots de passe forts et aléatoires grâce à des méthodes de génération sécurisées.
id: Buat kata sandi yang kuat dan acak secara instan menggunakan metode pembuatan yang aman.
ja: 安全な生成方法を使用して、強力でランダムなパスワードを即座に作成します。
pt_br: Crie senhas fortes e aleatórias instantaneamente usando métodos de geração seguros.
pt_pt: Crie palavras-passe fortes e aleatórias instantaneamente usando métodos de geração seguros.

# onboarding.description2
source: Instantly discover how resilient your password is against brute-force attacks.
de: Entdecken Sie sofort, wie widerstandsfähig Ihr Passwort gegen Brute-Force-Angriffe ist.
es: Descubre instantáneamente qué tan resistente es tu contraseña contra los ataques de fuerza bruta.
fr: Découvrez instantanément la résistance de votre mot de passe face aux attaques par force brute.
id: Temukan seketika seberapa tahan kata sandi Anda terhadap serangan brute-force.
ja: パスワードがブルートフォース攻撃に対してどれほど強固かを即座に確認します。
pt_br: Descubra instantaneamente o quão resistente é a sua senha contra ataques de força bruta.
pt_pt: Descubra instantaneamente o quão resistente é a sua palavra-passe contra ataques de força bruta.

# onboarding.description3
source: See the underlying representation of your passwords using standard algorithms like MD5 and SHA.
de: Sehen Sie die zugrunde liegende Darstellung Ihrer Passwörter mit Standardalgorithmen wie MD5 und SHA.
es: Consulta la representación subyacente de tus contraseñas usando algoritmos estándar como MD5 y SHA.
fr: Visualisez la représentation sous-jacente de vos mots de passe à l'aide d'algorithmes standard comme MD5 et SHA.
id: Lihat representasi dasar kata sandi Anda menggunakan algoritma standar seperti MD5 dan SHA.
ja: MD5やSHAなどの標準アルゴリズムを使用して、パスワードの基礎的な表現を確認します。
pt_br: Veja a representação das suas senhas usando algoritmos padrão como MD5 e SHA.
pt_pt: Veja a representação das suas palavras-passe usando algoritmos padrão como MD5 e SHA.

# onboarding.title1
source: Generate Passwords
de: Passwörter generieren
es: Generar contraseñas
fr: Générer des mots de passe
id: Buat kata sandi
ja: パスワードを生成
pt_br: Gere senhas
pt_pt: Gere palavras-passe

# onboarding.title2
source: Analyze Strength
de: Stärke analysieren
es: Analizar fortaleza
fr: Analyser la force
id: Analisis kekuatan
ja: 強度を分析
pt_br: Análise a força da senha
pt_pt: Analise a força da palavra-passe

# onboarding.title3
source: View Hashes
de: Hashes anzeigen
es: Ver hashes
fr: Voir les hachages
id: Lihat hash
ja: ハッシュを表示
pt_br: Veja os hashes
pt_pt: Veja os hashes

# password_length_label %lld characters_suffix
source: Password`s length: %lld characters
de: Passwortlänge: %lld Zeichen
es: Longitud de la contraseña: %lld caracteres
fr: Longueur du mot de passe : %lld caractères
id: Panjang kata sandi: %lld karakter
ja: パスワードの長さ：%lld 文字
pt_br: Comprimento da senha: %lld caracteres
pt_pt: Comprimento da palavra-passe: %lld caracteres

# password.action.copy
source: Copy
de: Kopieren
es: Copiar
fr: Copier
id: Salin
ja: コピー
pt_br: Copiar
pt_pt: Copiar

# password.generated.title
source: Generated Password
de: Generiertes Passwort
es: Contraseña generada
fr: Mot de passe généré
id: Kata sandi yang dibuat
ja: 生成されたパスワード
pt_br: Senha Gerada
pt_pt: Palavra-passe Gerada

# password.length.characters
source: Characters
de: Zeichen
es: Caracteres
fr: Caractères
id: Karakter
ja: 文字
pt_br: Caracteres
pt_pt: Caracteres

# password.length.title
source: Password length
de: Passwortlänge
es: Longitud de la contraseña
fr: Longueur du mot de passe
id: Panjang kata sandi
ja: パスワードの長さ
pt_br: Comprimento da senha
pt_pt: Comprimento da palavra-passe

# strength.fair
source: Fair
de: Akzeptabel
es: Aceptable
fr: Correct
id: Cukup
ja: 普通
pt_br: Razoável
pt_pt: Razoável

# strength.strong
source: Strong
de: Stark
es: Fuerte
fr: Fort
id: Kuat
ja: 強い
pt_br: Forte
pt_pt: Forte

# strength.title
source: Password strength
de: Passwortstärke
es: Fortaleza de la contraseña
fr: Force du mot de passe
id: Kekuatan kata sandi
ja: パスワード強度
pt_br: Força da senha
pt_pt: Força da palavra-passe

# strength.veryStrong
source: Very Strong
de: Sehr stark
es: Muy fuerte
fr: Très fort
id: Sangat kuat
ja: 非常に強い
pt_br: Muito Forte
pt_pt: Muito Forte

# strength.veryWeak
source: Very Weak
de: Sehr schwach
es: Muy débil
fr: Très faible
id: Sangat lemah
ja: 非常に弱い
pt_br: Muito Fraca
pt_pt: Muito Fraca

# strength.weak
source: Weak
de: Schwach
es: Débil
fr: Faible
id: Lemah
ja: 弱い
pt_br: Fraca
pt_pt: Fraca

# tap.action
source: Tap the password to copy
de: Passwort zum Kopieren antippen
es: Toca la contraseña para copiar
fr: Appuyez sur le mot de passe pour copier
id: Ketuk kata sandi untuk menyalin
ja: パスワードをタップしてコピー
pt_br: Clique na senha para copiar
pt_pt: Clique na palavra-passe para copiar

# bruteforce.title
source: Brute-force
es: Fuerza bruta
fr: Force brute
ja: ブルートフォース
pt_br: Força-bruta
pt_pt: Força-bruta

source: %lld min
id: %lld mnt
ja: %lld 分

source: %llds
id: %llddt
ja: %lld秒
